MODDIR=${0%/*}
ui_print "#############################################################"
ui_print "您正在安装的是 AWatchFixer 安卓手表通用救砖模块"
    echo '   ___ _      __     __      __   _____             '
    echo '  / _ | | /| / /__ _/ /_____/ /  / __(_)_ _____ ____'
    echo ' / __ | |/ |/ / _ `/ __/ __/ _ \/ _// /\ \ / -_) __/'
    echo '/_/ |_|__/|__/\_,_/\__/\__/_//_/_/ /_//_\_\\__/_/   '                                                             
    echo '   ___         _  __       ___  ___ '
    echo '  / _ )__ __  / |/ /__    |_  ||_  |'
    echo ' / _  / // / /    / _ \_ / __// __/ '
    echo '/____/\_, / /_/|_/\___(_)____/____/ '
    echo '     /___/                          '
ui_print "博客：no22.top"
ui_print "#############################################################"
ui_print " "
ui_print "- 正在释放文件"
ui_print "- 配置文件与日志位于 /data/adb/module/AWatchFixer/"
ui_print " "
ui_print "********************************************"
ui_print "-          ⚠当前为默认救砖策略⚠"
ui_print "- 第一次启动失败 → 再尝试一次启动"
ui_print "- 第二次启动失败 → 禁用所有 Magisk 模块"
ui_print "- 第三次启动失败 → 重启到 Recovery"
ui_print "- 第四次启动失败 → 重启到 Fastboot"
ui_print "- 第五次启动失败 → 关机"
ui_print "- 卡二屏超时时间：180 秒"
ui_print "********************************************"
ui_print " "
ui_print "- 如需自定义救砖操作和超时时间，请到配置文件自行修改"
ui_print "- 祝您玩机一路顺风，永不变砖"